In [1]:
import sys

In [2]:
sys.version_info

sys.version_info(major=3, minor=7, micro=3, releaselevel='final', serial=0)

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS")
else :
    print(" Windows ")

 Mac OS

In [4]:
import seaborn as sns

In [5]:
tips = sns.load_dataset("tips")

In [6]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [8]:
tips.ndim

2

In [9]:
tips.shape

(244, 7)

# 1. 쿼리 처리 알아보기

In [10]:
import pandas as pd

In [11]:
import FinanceDataReader as fdr
fdr.__version__

'0.7.2'

In [12]:
df_krx = fdr.StockListing('KRX')

### 문자열로 실행해서 내부 결과를 가져오기

In [13]:
item_name = "신라젠"

In [14]:
df_krx.query("Name=='{}'".format(item_name))

     Symbol Name           Sector           Industry
752  215600  신라젠  자연과학 및 공학 연구개발업  펙사벡(바이러스 항암면역치료제)

In [15]:
df_krx.query("Name=='{}'".format(item_name))[['Symbol','Name']]

     Symbol Name
752  215600  신라젠

### f 포맷으로 문자열 처리

In [16]:
df_kosdaq = fdr.StockListing('KOSDAQ')

In [17]:
item_name = "셀트리온헬스케어"

In [18]:
df_kosdaq.query(f"Name=='{item_name}'")

      Symbol      Name     Sector         Industry
1059  091990  셀트리온헬스케어  기타 전문 도매업  바이오의약품 마케팅 및 판매

In [19]:
df_kosdaq.query(f"Name=='{item_name}'")[['Symbol','Name']]

      Symbol      Name
1059  091990  셀트리온헬스케어

###  논리식을 이용한 쿼리

In [20]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [21]:
bill_30 = tips.query(f"total_bill > 30. ")

In [22]:
bill_30.head()

    total_bill   tip     sex smoker  day    time  size
11       35.26  5.00  Female     No  Sun  Dinner     4
23       39.42  7.58    Male     No  Sat  Dinner     4
39       31.27  5.00    Male     No  Sat  Dinner     3
44       30.40  5.60    Male     No  Sun  Dinner     4
47       32.40  6.00    Male     No  Sun  Dinner     4